# import pandas as pd
import cv2


# df = pd.read_csv('classes.csv', names=['Key', 'Value'])  
# # df.set_index('Key', inplace=True)
# character = 3337

# result = df[df['Value'] == character]['Key'].iloc[0]
# print(result)


# char_dict = {
#     'അ': 0, 'ആ': 1, 'ഇ': 2, 'ഉ': 3, 'എ': 4, 'ഏ': 5, 'ഒ': 6,  
#     'ക': 7, 'ഖ': 8, 'ഗ': 9, 'ഘ': 10, 'ങ': 11, 'ച': 12, 'ഛ': 13, 
#     'ജ': 14, 'ഝ': 15, 'ഞ': 16, 'ട': 17, 'ഠ': 18, 'ഡ': 19, 'ഢ': 20, 
#     'ണ': 21, 'ത': 22, 'ഥ': 23, 'ദ': 24, 'ധ': 25, 'ന': 26, 'പ': 27, 
#     'ഫ': 28, 'ബ': 29, 'ഭ': 30, 'മ': 31, 'യ': 32, 'ര': 33, 'റ': 34, 
#     'ല': 35, 'ള': 36, 'ഴ': 37, 'വ': 38, 'ശ': 39, 'ഷ': 40, 'സ': 41, 
#     'ഹ': 42,'ൺ': 43,'ൻ': 44, 'ർ': 45, 'ൽ': 46, 'ൾ': 47, 'ാ': 48, 
#     'ി': 49, 'ീ': 50, 'ു': 51, 'ൂ': 52, 'െ': 53, 'േ': 54, 'ൗ': 55, '൦': 56, 
#     '്യ': 57, '്ര': 58, '്വ': 59, 'ങ്ക': 60, 'ങ്ങ': 61, 'ച്ച': 62, 'ഞ്ഞ': 63, 'ന്ന': 64, 
#     'റ്റ': 65, 'ദ്ധ': 66, 'ന്ത': 67, 'ന്ദ': 68, 'മ്പ': 69, 'മ്മ': 70, 'യ്യ': 71, 'ല്ല': 72, 
#     'ള്ള': 73, 'വ്വ': 74, 'പ്പ': 75, 'ട്ട': 76, 'ണ്ണ': 77, 'ണ്ട': 78, ',': 79, '-': 80, '.': 81
# }

# image_path = 'raw_data/character_3342/6.png'
# image = cv2.imread(image_path)
# height, width, _ = image.shape

# print(height, width)


print('ല്ല')